### [DataFrame 연산 - 2]
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- DataFrame과 숫자데이터 연산 수행

In [1]:
# [1] 모듈 로딩
import pandas as pd

In [2]:
# [2] 데이터 준비
data={'A':[98,79,100,52],
      'B':[78,99,70,42]}

In [3]:
# [3] Dict 데이터 ==> DataFrame으로 저장
DF1=pd.DataFrame(data)
DF2=DF1/4

In [4]:
print(DF1, DF2, sep='\n\n')

     A   B
0   98  78
1   79  99
2  100  70
3   52  42

       A      B
0  24.50  19.50
1  19.75  24.75
2  25.00  17.50
3  13.00  10.50

In [5]:
# [4] 연산 수행
# - 산술 연산
DF1 - DF2

       A      B
0  73.50  58.50
1  59.25  74.25
2  75.00  52.50
3  39.00  31.50

In [6]:
DF2 * DF1

         A        B
0  2401.00  1521.00
1  1560.25  2450.25
2  2500.00  1225.00
3   676.00   441.00

In [7]:
# - 비교 연산
DF1 <= DF2

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

In [9]:
# [5] 연산 수행 => DataFrame과 Series
# - 산술 연산
# - 'A' 컬럼만 추출

SR1=DF1.A
SR1.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
DF2.index, DF2.columns

(RangeIndex(start=0, stop=4, step=1), Index(['A', 'B'], dtype='object'))

In [12]:
SR1 + DF2

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [14]:
# [방법1] Series ==> DataFrame으로 변환
SRDF=SR1.to_frame()
SRDF

     A
0   98
1   79
2  100
3   52

In [19]:
SRDF+DF2

        A   B
0  122.50 NaN
1   98.75 NaN
2  125.00 NaN
3   65.00 NaN

In [20]:
SRDF.add(DF2, fill_value=0)

        A      B
0  122.50  19.50
1   98.75  24.75
2  125.00  17.50
3   65.00  10.50

In [22]:
DF1.columns=[0,1]
DF1

     0   1
0   98  78
1   79  99
2  100  70
3   52  42

In [24]:
DF1.T+SR1

     0    1    2    3
0  196  158  200  104
1  176  178  170   94

In [25]:
DF1.shape, SR1.shape

((4, 2), (4,))